src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <attributes>
    <name>НаменованиеПоставщика</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходныеМатериалы</name>
    <attributes>
      <name>Расходник</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗаказПоставщику/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	РассчетСуммыМатериалы();	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	РассчетСуммыМатериалы();
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходныеМатериалы

&НаКлиенте
Процедура РасходникиЦенаПриИзменении(Элемент)
	РассчетСуммыРасходники();	
КонецПроцедуры

&НаКлиенте
Процедура РасходникиКоличествоПриИзменении(Элемент)
	РассчетСуммыРасходники();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РассчетСуммыМатериалы()
	СтрокаРасчета = Элементы.Материалы.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Количество * СтрокаРасчета.Цена;
КонецПроцедуры

&НаКлиенте
Процедура РассчетСуммыРасходники()
	СтрокаРасчета = Элементы.РасходныеМатериалы.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Количество * СтрокаРасчета.Цена;
КонецПроцедуры

#КонецОбласти
